SimpleConf/src/Documents/Продажа/Продажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Продажа</name>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SimpleConf/src/Documents/Продажа/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийТабличнаяЧасть

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РасчитатьСуммуПоСтроке(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РасчитатьСуммуПоСтроке(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти



#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура РасчитатьСуммуПоСтроке(ТекущиеДанные)
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;	
КонецПроцедуры

#КонецОбласти
